# GetPlaneReference Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Level..::..GetPlaneReference Method
Level Class See Also
---
Returns a reference to this element as a plane.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public Reference GetPlaneReference()
```

Visual Basic
---
```text
Public Function GetPlaneReference As Reference
```

Visual C++
---
```text
public:
Reference^ GetPlaneReference()
```

# See Also
Level Class
Autodesk.Revit.DB Namespace